# AnalysisZoneTopOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RouteAnalysisSettings..::..AnalysisZoneTopOffset Property
RouteAnalysisSettings Class See Also
---
The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020
# Syntax
C#
---
```text
public double AnalysisZoneTopOffset { get; set; }
```

Visual Basic
---
```text
Public Property AnalysisZoneTopOffset As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double AnalysisZoneTopOffset {
	double get ();
	void set (double value);
}
```

# Remarks
The zone's top plane elevation is different per plan view and is determined by adding the top offset to the view's level elevation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for topOffset must be non-negative. |

# See Also
RouteAnalysisSettings Class
Autodesk.Revit.DB.Analysis Namespace